$ontext
求解在固定正方形内，多个相同半径圆互不重叠时的最大半径
$offtext

* ---- 参数层 -----------------------------------------------------------------------------*

Set
    i   圆编号     /1, 2/;
    

Scalar
    side_len    正方形边长   /5/;

* ---- 变量层 -----------------------------------------------------------------------------*

Positive Variable
    r       半径
    x(i)    圆 i 的横坐标
    y(i)    圆 i 的纵坐标;

* ---- 模型层 -----------------------------------------------------------------------------*

* 互不重叠约束
Equation
    cond_1  互不重叠约束;
    
cond_1  ..  
    

